# Python for Data Analysis

## Curso Introducci√≥n a Python - Tecnun, Universidad de Navarra

Fernando Carazo


Website: [rcs.bu.edu](http://www.bu.edu/tech/support/research/) <br>

In [1]:
#Import Python Libraries
import numpy as np
import scipy as sp
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

Pandas is a python package that deals mostly with :
- **Series**  (1d homogeneous array)
- **DataFrame** (2d labeled heterogeneous array) 
- **Panel** (general 3d array)

### Pandas Series

Pandas *Series* is one-dimentional labeled array containing data of the same type (integers, strings, floating point numbers, Python objects, etc. ). The axis labels are often referred to as *index*.

In [2]:
# Example of creating Pandas series :

0   -3
1   -1
2    1
3    3
4    5
dtype: int64

We did not pass any index, so by default, it assigned the indexes ranging from 0 to len(data)-1

In [3]:
# View index values

RangeIndex(start=0, stop=5, step=1)

In [4]:
# Creating Pandas series with index:

a    0.186809
b   -0.961887
c   -1.639484
d    1.409116
e    1.059834
dtype: float64

In [5]:
# View index values

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

### Pandas DataFrame

Pandas *DataFrame* is two-dimensional, size-mutable, heterogeneous tabular data structure with labeled rows and columns ( axes ). Can be thought of a dictionary-like container to store python Series objects.

    Name  Age
0  Alice   21
1    Bob   25
2  Chris   23

In [8]:
#Add a new column:

    Name  Age  height
0  Alice   21     5.2
1    Bob   25     6.0
2  Chris   23     5.6

In [12]:
#Read csv file
df = pd.read_csv("./data/Salaries.csv")

In [13]:
#Display a few first records
df.head(10)

        rank discipline  phd  service   sex  salary
0       Prof          B   56       49  Male  186960
1       Prof          A   12        6  Male   93000
2       Prof          A   23       20  Male  110515
3       Prof          A   40       31  Male  131205
4       Prof          B   20       18  Male  104800
5       Prof          A   20       20  Male  122400
6  AssocProf          A   20       17  Male   81285
7       Prof          A   18       18  Male  126300
8       Prof          A   29       19  Male   94350
9       Prof          A   51       51  Male   57800

![image.png](img/dfAtributeS.PNG)

In [22]:
#Identify the type of df object

pandas.core.frame.DataFrame

In [23]:
#Check the type of a column "salary"

dtype('int64')

In [24]:
#List the types of all columns

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [25]:
#List the column names

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [26]:
#List the row labels and the column names

[RangeIndex(start=0, stop=78, step=1),
 Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')]

RangeIndex(start=0, stop=78, step=1)

In [29]:
#Number of dimensions

2

In [30]:
#Total number of elements in the Data Frame

468

In [31]:
#Number of rows and columns

(78, 6)

![image.png](img/dfMethods.PNG)

In [48]:
#Output basic statistics for the numeric columns

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [49]:
#Calculate mean for all numeric columns

phd            19.705128
service        15.051282
salary     108023.782051
dtype: float64

---
*Exercise*

In [6]:
#Display first 20 records
# <your code goes here>

In [7]:
#Find how many records this data frame has;
# <your code goes here>

In [8]:
#Display the last 5 records
# <your code goes here>

In [1]:
#Calculate the standard deviation (std() method) for all numeric columns
# <your code goes here>

In [51]:
#Calculate average of the columns in the first 50 rows
# <your code goes here>

---
### Data slicing and grouping

In [52]:
#Extract a column by name (method 1)

0    Male
1    Male
2    Male
3    Male
4    Male
Name: sex, dtype: object

---
*Exercise*

---

In [55]:
#Group data using rank

In [56]:
#Calculate mean of all numeric columns for the grouped object

                 phd    service         salary
rank
AssocProf  15.076923  11.307692   91786.230769
AsstProf    5.052632   2.210526   81362.789474
Prof       27.065217  21.413043  123624.804348

              phd    service         salary
sex
Female  16.512821  11.564103  101002.410256
Male    22.897436  18.538462  115045.153846

In [58]:
#Calculate the mean salary for men and women. The following produce Pandas Series (single brackets around salary)

sex
Female    101002.410256
Male      115045.153846
Name: salary, dtype: float64

In [59]:
# If we use double brackets Pandas will produce a DataFrame

               salary
sex
Female  101002.410256
Male    115045.153846

In [60]:
# Group using 2 variables - sex and rank:

                         salary
rank      sex
AssocProf Female   88512.800000
          Male    102697.666667
AsstProf  Female   78049.909091
          Male     85918.000000
Prof      Female  121967.611111
          Male    124690.142857

---
*Exercise*

In [53]:
#Calculate the basic statistics for the salary column (used describe() method)
# <your code goes here>

In [2]:
#Calculate how many values in the salary column (use count() method)
# <your code goes here>

In [ ]:
# Group data by the discipline and find the average salary for each group

---
### Filtering

In [4]:
#Select observation with the value in the salary column > 120K

[Int64Index([ 0,  3,  5,  7, 10, 11, 13, 14, 15, 19, 26, 27, 29, 31, 35, 36, 39,
             40, 44, 45, 49, 51, 58, 72, 75],
            dtype='int64'),
 Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')]

In [63]:
#Select data for female professors

         rank discipline  phd  service     sex  salary
39       Prof          B   18       18  Female  129000
40       Prof          A   39       36  Female  137000
41  AssocProf          A   13        8  Female   74830
42   AsstProf          B    4        2  Female   80225
43   AsstProf          B    5        0  Female   77000

---
### More on slicing the dataset

In [75]:
#Select column salary

In [76]:
#Check data type of the result

pandas.core.series.Series

In [77]:
#Look at the first few elements of the output

0    186960
1     93000
2    110515
3    131205
4    104800
Name: salary, dtype: int64

In [78]:
#Select column salary and make the output to be a data frame

In [79]:
#Check the type

pandas.core.frame.DataFrame

In [80]:
#Select a subset of rows (based on their position):
# Note 1: The location of the first row is 0
# Note 2: The last value in the range is not included

        rank discipline  phd  service   sex  salary
0       Prof          B   56       49  Male  186960
1       Prof          A   12        6  Male   93000
2       Prof          A   23       20  Male  110515
3       Prof          A   40       31  Male  131205
4       Prof          B   20       18  Male  104800
5       Prof          A   20       20  Male  122400
6  AssocProf          A   20       17  Male   81285
7       Prof          A   18       18  Male  126300
8       Prof          A   29       19  Male   94350
9       Prof          A   51       51  Male   57800

In [81]:
#If we want to select both rows and columns we can use method .loc

        rank   sex  salary
10      Prof  Male  128250
11      Prof  Male  134778
12  AsstProf  Male   88000
13      Prof  Male  162200
14      Prof  Male  153750
15      Prof  Male  150480
16  AsstProf  Male   75044
17  AsstProf  Male   92000
18      Prof  Male  107300
19      Prof  Male  150500
20  AsstProf  Male   92000

    salary
1    93000
2   110515
3   131205
4   104800
5   122400
6    81285
7   126300
8    94350
9    57800
10  128250

In [87]:
#Let's see what we get for our df_sub data frame
# Method .loc subset the data frame based on the labels:

    rank   sex  salary
10  Prof  Male  128250
11  Prof  Male  134778
13  Prof  Male  162200
14  Prof  Male  153750
15  Prof  Male  150480
19  Prof  Male  150500

In [88]:
#  Unlike method .loc, method iloc selects rows (and columns) by poistion:

    rank  service     sex  salary
26  Prof       19    Male  148750
27  Prof       43    Male  155865
29  Prof       20    Male  123683
31  Prof       21    Male  155750
35  Prof       23    Male  126933
36  Prof       45    Male  146856
39  Prof       18  Female  129000
40  Prof       36  Female  137000
44  Prof       19  Female  151768
45  Prof       25  Female  140096

### Sorting the Data

In [89]:
#Sort the data frame by yrs.service and create a new data frame

        rank discipline  phd  service     sex  salary
55  AsstProf          A    2        0  Female   72500
23  AsstProf          A    2        0    Male   85000
43  AsstProf          B    5        0  Female   77000
17  AsstProf          B    4        0    Male   92000
12  AsstProf          B    1        0    Male   88000

In [90]:
#Sort the data frame by yrs.service and overwrite the original dataset

    rank discipline  phd  service     sex  salary
9   Prof          A   51       51    Male   57800
0   Prof          B   56       49    Male  186960
36  Prof          B   45       45    Male  146856
27  Prof          A   45       43    Male  155865
40  Prof          A   39       36  Female  137000

In [91]:
# Restore the original order (by sorting using index)

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

---
*Exercise*

In [6]:
# Using filtering, find the mean value of the salary for the discipline A

In [74]:
# Challange:
# Extract (filter) only observations with high salary ( > 100K) and find how many female and male professors in each group

In [92]:
# Sort data frame by the salary (in descending order) and display the first few records of the output (head)

---

In [93]:
#Sort the data frame using 2 or more columns:

        rank discipline  phd  service     sex  salary
52      Prof          A   12        0  Female  105000
17  AsstProf          B    4        0    Male   92000
12  AsstProf          B    1        0    Male   88000
23  AsstProf          A    2        0    Male   85000
43  AsstProf          B    5        0  Female   77000
55  AsstProf          A    2        0  Female   72500
57  AsstProf          A    3        1  Female   72500
28  AsstProf          B    7        2    Male   91300
42  AsstProf          B    4        2  Female   80225
68  AsstProf          A    4        2  Female   77500

### Missing Values

In [7]:
# Read a dataset with missing values data/flights.csv


>**Hands-on exercises**
>
>- Find how many records this data frame has;
>
>- How many elements are there?
>
>- What are the column names?
>
>- What types of columns we have in this data frame?

![](https://predictivehacks.com/wp-content/uploads/2020/08/numpy_arrays-1024x572.png)

In [111]:
df_aux = pd.DataFrame({"A": [1,2,3], "B": [1,2,3]})

   A  B
0  1  1
1  2  2
2  3  3

0    2
1    4
2    6
dtype: int64

In [118]:
# Select the rows that have at least one missing value

,year,month,day,dep_time,dep_delay,arr_time,arr_delay,carrier,tailnum,flight,origin,dest,air_time,distance,hour,minute
330,2013,1,1,1807.0,29.0,2251.0,NaN,UA,N31412,1228,EWR,SAN,NaN,2425,18.0,7.0
403,2013,1,1,NaN,NaN,NaN,NaN,AA,N3EHAA,791,LGA,DFW,NaN,1389,NaN,NaN
404,2013,1,1,NaN,NaN,NaN,NaN,AA,N3EVAA,1925,LGA,MIA,NaN,1096,NaN,NaN
855,2013,1,2,2145.0,16.0,NaN,NaN,UA,N12221,1299,EWR,RSW,NaN,1068,21.0,45.0
858,2013,1,2,NaN,NaN,NaN,NaN,AA,NaN,133,JFK,LAX,NaN,2475,NaN,NaN

In [123]:
# Filter all the rows where arr_delay value is missing:

,year,month,day,dep_time,dep_delay,arr_time,arr_delay,carrier,tailnum,flight,origin,dest,air_time,distance,hour,minute
0,2013,1,1,517.0,2.0,830.0,11.0,UA,N14228,1545,EWR,IAH,227.0,1400,5.0,17.0
1,2013,1,1,533.0,4.0,850.0,20.0,UA,N24211,1714,LGA,IAH,227.0,1416,5.0,33.0
2,2013,1,1,542.0,2.0,923.0,33.0,AA,N619AA,1141,JFK,MIA,160.0,1089,5.0,42.0
3,2013,1,1,554.0,-6.0,812.0,-25.0,DL,N668DN,461,LGA,ATL,116.0,762,5.0,54.0
4,2013,1,1,554.0,-4.0,740.0,12.0,UA,N39463,1696,EWR,ORD,150.0,719,5.0,54.0

In [124]:
# Remove all the observations with missing values

In [125]:
# Fill missing values with zeros

False

---
*Exercise*

In [ ]:
# Count how many missing data are in dep_delay and arr_delay columns

---
### Common Aggregation Functions:

|Function|Description
|-------|--------
|min   | minimum
|max   | maximum
|count   | number of non-null observations
|sum   | sum of values
|mean  | arithmetic mean of values
|median | median
|mad | mean absolute deviation
|mode | mode
|prod   | product of values
|std  | standard deviation
|var | unbiased variance

In [126]:
# Find the number of non-missing values in each column

,year,month,day,dep_time,dep_delay,arr_time,arr_delay,flight,air_time,distance,hour,minute
count,160754.0,160754.000000,160754.000000,158418.000000,158418.000000,158275.000000,157927.000000,160754.000000,157927.000000,160754.000000,158418.000000,158418.000000
mean,2013.0,6.547395,15.716567,1316.146006,9.463773,1517.471161,2.094537,1156.344987,180.685158,1282.445420,12.837582,32.387847
std,0.0,3.410001,8.762794,470.823715,36.545109,510.695413,41.479349,695.884283,97.507866,765.895383,4.725552,18.687423
min,2013.0,1.000000,1.000000,1.000000,-33.000000,1.000000,-75.000000,1.000000,21.000000,17.000000,0.000000,0.000000
25%,2013.0,4.000000,8.000000,855.000000,-5.000000,1112.000000,-19.000000,504.000000,111.000000,733.000000,8.000000,16.000000
50%,2013.0,7.000000,16.000000,1345.000000,-2.000000,1541.000000,-7.000000,1157.000000,153.000000,1076.000000,13.000000,32.000000
75%,2013.0,10.000000,23.000000,1725.000000,7.000000,1944.000000,9.000000,1715.000000,258.000000,1728.000000,17.000000,51.000000
max,2013.0,12.000000,31.000000,2400.000000,1014.000000,2400.000000,1007.000000,2599.000000,695.000000,4963.000000,24.000000,59.000000

In [127]:
# Find min value for all the columns in the dataset

year         2013
month           1
day             1
dep_time        1
dep_delay     -33
arr_time        1
arr_delay     -75
carrier        AA
flight          1
origin        EWR
dest          ANC
air_time       21
distance       17
hour            0
minute          0
dtype: object

In [128]:
# Let's compute summary statistic per a group':

carrier
AA     8.586016
AS     5.804775
DL     9.264505
UA    12.106073
US     3.782418
Name: dep_delay, dtype: float64

In [129]:
# We can use agg() methods for aggregation:

        dep_delay    arr_delay
min    -33.000000   -75.000000
mean     9.463773     2.094537
max   1014.000000  1007.000000

In [130]:
# An example of computing different statistics for different columns

           dep_delay  carrier
max      1014.000000      NaN
mean        9.463773      NaN
min       -33.000000      NaN
nunique          NaN      5.0

### Basic descriptive statistics

|Function|Description
|-------|--------
|min   | minimum
|max   | maximum
|mean  | arithmetic mean of values
|median | median
|mad | mean absolute deviation
|mode | mode
|std  | standard deviation
|var | unbiased variance
|sem | standard error of the mean
|skew| sample skewness
|kurt|kurtosis
|quantile| value at %

In [131]:
# Convinient describe() function computes a veriety of statistics

count    158418.000000
mean          9.463773
std          36.545109
min         -33.000000
25%          -5.000000
50%          -2.000000
75%           7.000000
max        1014.000000
Name: dep_delay, dtype: float64

In [132]:
# find the index of the maximum or minimum value
# if there are multiple values matching idxmin() and idxmax() will return the first match

54111

In [9]:
# Count the number of records for each different value in a vector